In [ ]:
This gives a clean output with null values converted into 0s
SELECT id, 
COALESCE(SUM(CASE WHEN month="Jan" THEN revenue end), 0) AS Jan_revenue, 
COALESCE(SUM(CASE WHEN month="Feb" THEN revenue end), 0) AS Feb_revenue,
COALESCE(SUM(CASE WHEN month="Mar" THEN revenue end), 0) AS Mar_revenue,
COALESCE(SUM(CASE WHEN month="Apr" THEN revenue end), 0) AS Apr_revenue,
COALESCE(SUM(CASE WHEN month="May" THEN revenue end), 0) AS May_revenue,
COALESCE(SUM(CASE WHEN month="Jun" THEN revenue end), 0) AS Jun_revenue,
COALESCE(SUM(CASE WHEN month="Jul" THEN revenue end), 0) AS Jul_revenue,
COALESCE(SUM(CASE WHEN month="Aug" THEN revenue end), 0) AS Aug_revenue,
COALESCE(SUM(CASE WHEN month="Sep" THEN revenue end), 0) AS Sep_revenue,
COALESCE(SUM(CASE WHEN month="Oct" THEN revenue end), 0) AS Oct_revenue,
COALESCE(SUM(CASE WHEN month="Nov" THEN revenue end), 0) AS Nov_revenue,
COALESCE(SUM(CASE WHEN month="Dec" THEN revenue end), 0) AS Dec_revenue
FROM department
GROUP BY id;




If you have to have null in the output:
SELECT id,
SUM(CASE WHEN month="Jan" THEN revenue else null end) AS Jan_Revenue, 
SUM(CASE WHEN month="Feb" THEN revenue else null end) AS Feb_Revenue,
SUM(CASE WHEN month="Mar" THEN revenue else null end) AS Mar_Revenue,
SUM(CASE WHEN month="Apr" THEN revenue else null end) AS Apr_Revenue,
SUM(CASE WHEN month="May" THEN revenue else null end) AS May_Revenue,
SUM(CASE WHEN month="Jun" THEN revenue else null end) AS Jun_Revenue,
SUM(CASE WHEN month="Jul" THEN revenue else null end) AS Jul_Revenue,
SUM(CASE WHEN month="Aug" THEN revenue else null end) AS Aug_Revenue,
SUM(CASE WHEN month="Sep" THEN revenue else null end) AS Sep_Revenue,
SUM(CASE WHEN month="Oct" THEN revenue else null end) AS Oct_Revenue,
SUM(CASE WHEN month="Nov" THEN revenue else null end) AS Nov_Revenue,
SUM(CASE WHEN month="Dec" THEN revenue else null end) AS Dec_Revenue
FROM department
GROUP BY id;

Output: {"headers":["id","Jan_Revenue","Feb_Revenue","Mar_Revenue","Apr_Revenue","May_Revenue","Jun_Revenue","Jul_Revenue","Aug_Revenue","Sep_Revenue","Oct_Revenue","Nov_Revenue","Dec_Revenue"],"values":[[1,8000,7000,6000,null,null,null,null,null,null,null,null,null],[2,9000,null,null,null,null,null,null,null,null,null,null,null],[3,null,10000,null,null,null,null,null,null,null,null,null,null]]}


I thought it would be less time consuming if there is a way to automate the column name selection and value assignment while creating pivot table. Tried the following but it did not work; not sure about the syntax. 
SELECT id,
EXPAND(SUM(CASE WHEN month=(SELECT DISTINCT(month) AS month_name FROM department) s1 THEN revenue else null)) As s1.month_name
FROM department
GROUP BY id;